yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/InformationRegisters/СК_БлокировкаСекций/СК_БлокировкаСекций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_БлокировкаСекций</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>EnumRef.СК_СтатусыБлокировокСекций</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/ФормаИнвентаризации/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДокументПересчета();
	ЗаполнитьОформление(); 
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОформление()
	
	
КонецПроцедуры 
	
&НаСервере
Процедура ЗаполнитьДокументПересчета() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПересчетТоваров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПересчетТоваров КАК ПересчетТоваров
	               |ГДЕ
	               |	
	               |	ПересчетТоваров.ПометкаУдаления = Ложь
	               |	И ПересчетТоваров.Дата <= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПересчетТоваров.Дата УБЫВ"; 
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Элементы.ДекорацияОшибка.Заголовок = "";
		ДокументПересчета = Рез.Ссылка; 
		ЗаполнитьТабСекций(Рез.Ссылка);
	Иначе
		Элементы.ДекорацияОшибка.Заголовок = "Нет документа инвентаризации";
	КонецЕсли;
	
	
КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьТабСекций(СсылкаДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_БлокировкаСекций.Секция КАК Секция,
	               |	СК_БлокировкаСекций.Блокировка КАК Блокировка
	               |ИЗ
	               |	РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
	               |ГДЕ
	               |	СК_БлокировкаСекций.ДокументПересчета = &ДокументПересчета"; 
	Запрос.УстановитьПараметр("ДокументПересчета",СсылкаДок);
	
	ТабСекций.Очистить();
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()>=1 Тогда
		ТабСекций.Загрузить(Рез);
	Иначе
		ЗаполнитьРегистрСекций(СсылкаДок);
	КонецЕсли;
	
	
КонецПроцедуры 
	
&НаСервере
Процедура ЗаполнитьРегистрСекций(СсылкаДок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СК_Ячейки.Секция КАК Секция
	               |ИЗ
	               |	Справочник.СК_Ячейки КАК СК_Ячейки
	               |ГДЕ
	               |	СК_Ячейки.Секция <> """" "; 
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.СК_БлокировкаСекций.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = СсылкаДок.Дата;
		НоваяЗапись.ДокументПересчета = СсылкаДок;
		НоваяЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Расчет;
		НоваяЗапись.Секция = Рез.Секция;
		НоваяЗапись.Записать(
		Истина // замещать, если уже есть запись с такими же измерениями
		// и таким же периодом
		);
	КонецЦикла;
	ЗаполнитьТабСекций(СсылкаДок);
КонецПроцедуры

&НаСервере
Процедура ДокументПересчетаПриИзмененииНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ДокументПересчетаПриИзменении(Элемент)
	ЗаполнитьТабСекций(ЭтотОбъект.ДокументПересчета);
КонецПроцедуры

&НаКлиенте
Процедура ТабСекцийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Строка(Элемент.ТекущиеДанные.Блокировка) = "Завершено" ИЛИ Строка(Элемент.ТекущиеДанные.Блокировка) = "Передано"  Тогда
		ВывестиСообщениеОшибки("Пересчет по ячейке не доступен","Ошибка");
	Иначе
		ОткрытьФормуИнвентаризацииСекции(Элемент.ТекущиеДанные.Секция);
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВывестиСообщениеОшибки(Текст,ЗаголовокОшибки) 
	
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,Строка(Текст),5,Строка(ЗаголовокОшибки));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт  

КонецПроцедуры



&НаКлиенте
Процедура ОткрытьФормуИнвентаризацииСекции(Секция)
			ПараметрыФормыОстатки = Новый Структура;
			ПараметрыФормыОстатки.Вставить("Секция",Секция);
			ПараметрыФормыОстатки.Вставить("ДокументПересчета",ДокументПересчета);
			
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаИнвентаризацииСекции", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	ЗаполнитьТабСекций(ДокументПересчета);	
КонецПроцедуры
